"use client"
import { title } from 'process';
import React, { useState } from 'react'

const Navbar = () => {

  const [isOpen, setIsOpen] = useState(false);
  const [selectModal, setSelectModal] = useState<{title:string,description:string} | null>(null);

  const modal1={
    title:"مسند ابي حنيف", 
    description:" شيء وقد ذكر المؤرخون أن لأبي حنيفة كتبًا كثيرة منها كتاب العلم والتعلم، وكتاب الرد على القدرية وكتاب الفقه الأكبر هذا بجانب أنه قد صح أن أبا حنيفة انفرد بإخراج ٢١٥ حديثًا سوى ما اشوى ما اشترك في إخراجه مع بقية الأئمة. كما أن له مسندًا روى فيه ١١٨ حديثًا كلها في باب الصلاة. وقد قام بجمع الأحاديوى ما اشترك في إخراجه مع بقية الأئمة. كما أن له مسندًا روى فيه ١١٨ حديثًا كلها في باب الصلاة. وقد قام بجمع الأحاديوى ما اشترك في إخراجه مع بقية الأئمة. كما أن له مسندًا روى فيه ١١٨ حديثًا كلها في باب الصلاة. وقد قام بجمع الأحاديوى ما اشترك في إخراجه مع بقية الأئمة. كما أن له مسندًا روى فيه ١١٨ حديثًا كلها في باب الصلاة. وقد قام بجمع الأحاديوى ما اشترك في إخراجه مع بقية الأئمة. كما أن له مسندًا روى فيه ١١٨ حديثًا كلها في باب الصلاة. وقد قام بجمع الأحاديوى ما اشترك في إخراجه مع بقية الأئمة. كما أن له مسندًا روى فيه ١١٨ حديثًا كلها في باب الصلاة. وقد قام بجمع الأحاديوى ما اشترك في إخراجه مع بقية الأئمة. كما أن له مسندًا روى فيه ١١٨ حديثًا كلها في باب الصلاة. وقد قام بجمع الأحاديوى ما اشترك في إخراجه مع بقية الأئمة. كما أن له مسندًا روى فيه ١١٨ حديثًا كلها في باب الصلاة. وقد قام بجمع الأحاديوى ماحديثًا كلها في باب الصلاة. وقد قام بجمع الأحاديوى ما اشترك في إخراجه مع بقية الأئمة. كما أن له مسندًا روى فيه ١١٨ حديثًا كلها في باب الصلاة. وقد قام بجمع الأحاديوى ما اشترك في إخراجه مع بقية الأئمة. كما أن له مسندًا روى فيه ١١٨ حديثًا كلها في باب الصلاة. وقد قام بجمع الأحاديوى ما اشترك في إخراجه مع بقية الأئمة. كما أن له مسندًاw روى فيه ١١٨ حديثًا كلها في باب الصلاة. وقد قام بجمع الأحاديوى ما اشترك في إخراجه مع بقية الأئمة. كما أن له مسندًا روى فيه ١١٨ حديثًا كلها في باب الصلاة. وقد قام بجمع الأحاديوى ما اشترك في إخراجه مع بقية الأئمة. كما أن له مسندًا روى فيه ١١٨ حديثًا كلها في باب الصلاة. وقد قام بجمع الأحاديوى ما اشترك في إخراجه مع بقية الأئمة. كما أن له مسندًا روى فيه ١١٨ حديثًا كلها في باب الصلاة. وقد قام بجمع الأحاديترك في إخراجه مع بقية الأئمة. كما أن له مسندًا روى فيه ١١٨ حديثًا كلها في باب الصلاة. وقد قام بجمع الأحاديث التي أخرجها أبو حنيفة أبو المؤيد محمد بن محمود الخوارزمي (ت ٦٦٥ هـ). فوقعت في ٨٠٠ صفحة كبيرة وقد طبع هذا المسند في مصر سنة ١٣٢٦ هـ ذلك كتاب الآثار، لأبي يوسف وكتاب الآثار لمحمد بن الحسن. وإن كان أبو حنيفة لم يدون بنفسه شيئًا من محتويات هذه الكتب إلا أنها من فقه "}
  const modal2={
    title:"رواية الحصكفسند ", 
    description:" شيء وقد ذكر المؤرخون أن لأبي حنيفة كتبًا كثيرة منها كتاب العلم والتعلم، وكتاب الرد على القدرية وكتاب الفقه الأكبر هذا بجانب أنه قد صح أن أبا حنيفة انفرد بإخراج ٢١٥ حديثًا سوى ما اشترك في إخراجه مع بقية الأئمة. كما أن له مسندًا روى فيه ١١٨ حديثًا كلها في باب الصلاة. وقد قام بجمع الأحاديوى ما اشترك في إخراجه مع بقية الأئمة. كما أن له مسندًا روى فيه ١١٨ حديثًا كلها في باب الصلاة. وقد قام بجمع الأحاديوى ما اشترك في إخراجه مع بقية الأئمة. كما أن له مسندًا روى فيه ١١٨ حديثًا كلها في باب الصلاة. وقد قام بجمع الأحاديوى ما اشترك في إخراجه مع بقية الأئمة. كما أن له مسندًا روى فيه ١١٨ حديثًا كلها في باب الصلاة. وقد قام بجمع الأحاديوى ما اشترك في إخراجه مع بقية الأئمة. كما أن له مسندًا روى فيه ١١٨ حديثًا كلها في باب الصلاة. وقد قام بجمع الأحاديوى ما اشترك في إخراجه مع بقية الأئمة. كما أن له مسندًا روى فيه ١١٨ حديثًا كلها في باب الصلاة. وقد قام بجمع الأحاديوى ما اشترك في إخراجه مع بقية الأئمة. كما أن له مسندًا روى فيه ١١٨ حديثًا كلها في باب الصلاة. وقد قام بجمع الأحاديوى ما اشترك في إخراجه مع بقية الأئمة. كما أن له مسندًا روى فيه ١١٨ حديثًا كلها في باب الصلاة. وقد قام بجمع الأحاديوى ما اشترك في إخراجه مع بقية الأئمة. كما أن له مسندًا روى فيه ١١٨ حديثًا كلها في باب الصلاة. وقد قام بجمع الأحاديوى ما اشترك في إخراجه في باب الصلاة. وقد قام بجمع الأحاديوى ما اشترك في إخراجه مع بقية الأئمة. كما أن له مسندًا روى فيه ١١٨ حديثًا كلها في باب الصلاة. وقد قام بجمع الأحاديوى ما اشترك في إخراجه مع بقية الأئمة. كما أن له مسندًا روى فيه ١١٨ حديثًا كلها في باب الصلاة. وقد قام بجمع الأحاديوى ما اشترك في إخراجه مع بقية الأئمة. كما أن له مسندًا روى فيه ١١٨ حديثًا كلها في باب الصلاة. وقد قام بجمع الأحاديوى ما اشترك في إخراجه مع بقية الأئمة. كما أن له مسندًا روى فيه ١١٨ حديثًا كلها في باب الصلاة. وقد قام بجمع الأحاديوى ما اشترك في إخراجه مع بقية الأئمة. كما أن له مسندًا روى فيه ١١٨ حديثًا كلها في باب الصلاة. وقد قام بجمع الأحاديث التي أخرجها أبو حنيفة أبو المؤيد محمد بن محمود الخوارزمي (ت ٦٦٥ هـ). فوقعت في ٨٠٠ صفحة كبيرة وقد طبع هذا المسند في مصر سنة ١٣٢٦ هـ ذلك كتاب الآثار، لأبي يوسف وكتاب الآثار لمحمد بن الحسن. وإن كان أبو حنيفة لم يدون بنفسه شيئًا من محتويات هذه الكتب إلا أنها من فقه "}

  const handleModalOpen = (id:number) => {
    if (id === 1) {
     setSelectModal(modal1)
    } else if (id === 2) {
    setSelectModal(modal2)
    }
      setIsOpen(true);
  }

  return (
    <div className='flex justify-end'>
      <div className='primary-div flex gap-4 pb-1'>

        <div className='p-div1 font-bold border border-sky-200 bg-sky-50 
        rounded-md lg:text-2xl md:text-2xl text-md lg:px-1 lg:py-3 md:py-3 py-1 text-blue-600'>
        <button className='cursor-pointer' onClick={() => handleModalOpen(1)}>
          أبو حنيفة النعمان (ت ١٥٠)
          </button> 
        </div>
        <div className='p-div2 lg:text-2xl lg:px-1 lg:py-3 md:py-3 py-1 md:text-2xl text-md text-black'><h1>  —  </h1></div>
        <div className='p-div3 font-bold border border-sky-200 bg-sky-50
        rounded-md lg:text-2xl  md:text-2xl text-md lg:px-1 lg:py-3 md:py-3 py-1 text-blue-600'> <button className='cursor-pointer'  onClick={() => handleModalOpen(2)}>   مسند أبي حنيفة رواية الحصكفي  </button></div>

        <div className='p-div3 font-bold border border-sky-200 bg-sky-50
        rounded-md lg:text-2xl md:text-2xl text-md lg:px-1 lg:py-3 md:py-3 py-1 text-blue-600'> <button className='cursor-pointer text-blue-600'>→</button> </div>
{isOpen && (
  <div className="fixed inset-0 flex items-center justify-center bg-gray-400/40 p-2 ">
    <div className="bg-white p-4  shadow-lg w-full max-w-md sm:max-w-lg lg:max-w-xl relative ">
      
      {/* Close Button */}
      <button
        onClick={() => setIsOpen(false)}
        className="absolute -top-4 -right-4 text-xl font-bold w-10 h-10 border-4 border-gray-600 flex items-center justify-center rounded-full bg-white hover:bg-gray-300"
      >
        ✕
      </button>

      {/* Title */}
      <h2 className="lg:text-4xl text-2xl font-semibold mb-4 text-center text-gray-800">
        {selectModal?.title}
      </h2>

      {/* Scrollable Description */}
      <div className="max-h-72  pr-2 overflow-y-auto scrollbar-left">
        <p className="text-gray-700 lg:text-2xl text-xl text-right">
          {selectModal?.description}
        </p>
      </div>
    </div>
  </div>
)}

      </div>
    </div>
  )
}

export default Navbar

