{
  "hadiths": [
    {
      "id": "iman",
      "title": "كتاب الإيمان والإسلام والقدر والشفاعة",
      "content": {
        "id": 1,
        "hadith": "بينما نحن عند رسول الله ﷺ إذ طلع رجل شديد بياض الثياب شديد سواد الشعر لا يرى عليه أثر السفر ولا يعرفه منا أحد، حتى جلس إلى النبي ﷺ، فأسند ركبتيه إلى ركبتيه، ووضع كفيه على فخذيه، وقال: يا محمد أخبرني عن الإسلام؟ فقال رسول الله ﷺ: الإسلام أن تشهد أن لا إله إلا الله وأن محمداً رسول الله، وتقيم الصلاة، وتؤتي الزكاة، وتصوم رمضان، وتحج البيت إن استطعت إليه سبيلا. قال: صدقت. قال: فأخبرني عن الإيمان؟ قال: أن تؤمن بالله وملائكته وكتبه ورسله واليوم الآخر وتؤمن بالقدر خيره وشره. قال: صدقت. قال: فأخبرني عن الإحسان؟ قال: أن تعبد الله كأنك تراه، فإن لم تكن تراه فإنه يراك.",
        "source": "مسند أبي حنيفة",
        "narrator": "أبو حنيفة النعمان"
      }
    },
    {
      "id": "ilm",
      "title": "كتاب العلم",
      "content": {
        "id": 2,
        "hadith": "من سلك طريقاً يلتمس فيه علماً سهّل الله له به طريقاً إلى الجنة، وإن الملائكة لتضع أجنحتها لطالب العلم رضاً بما يصنع، وإن العالم ليستغفر له من في السماوات ومن في الأرض، حتى الحيتان في البحر. وفضل العالم على العابد كفضل القمر ليلة البدر على سائر الكواكب، وإن العلماء ورثة الأنبياء، وإن الأنبياء لم يورثوا ديناراً ولا درهماً وإنما ورّثوا العلم، فمن أخذه أخذ بحظ وافر.",
        "source": "مسند أبي حنيفة",
        "narrator": "أبو حنيفة النعمان"
      }
    },
    {
      "id": "tahara",
      "title": "كتاب الطهارة",
      "content": {
        "id": 3,
        "hadith": "الطهور شطر الإيمان، والحمد لله تملأ الميزان، وسبحان الله والحمد لله تملآن أو تملأ ما بين السماوات والأرض. والصلاة نور، والصدقة برهان، والصبر ضياء، والقرآن حجة لك أو عليك. كل الناس يغدو فبائع نفسه، فمعتقها أو موبقها.",
        "source": "مسند أبي حنيفة",
        "narrator": "أبو حنيفة النعمان"
      }
    },
    {
      "id": "salat",
      "title": "كتاب الصلاة",
      "content": {
        "id": 4,
        "hadith": "إن أول ما يحاسب به العبد يوم القيامة صلاته، فإن صلحت فقد أفلح وأنجح، وإن فسدت فقد خاب وخسر. فإن انتقص من فريضته شيء، قال الرب عز وجل: انظروا هل لعبدي من تطوع فيكمل بها ما انتقص من الفريضة، ثم يكون سائر عمله على ذلك.",
        "source": "مسند أبي حنيفة",
        "narrator": "أبو حنيفة النعمان"
      }
    },
    {
      "id": "zakat",
      "title": "كتاب الزكاة",
      "content": {
        "id": 5,
        "hadith": "ما نقصت صدقة من مال، وما زاد الله عبداً بعفو إلا عزاً، وما تواضع أحد لله إلا رفعه الله. واليد العليا خير من اليد السفلى، وابدأ بمن تعول.",
        "source": "مسند أبي حنيفة",
        "narrator": "أبو حنيفة النعمان"
      }
    },
    {
      "id": "sawm",
      "title": "كتاب الصوم",
      "content": {
        "id": 6,
        "hadith": "قال رسول الله ﷺ: قال الله عز وجل: كل عمل ابن آدم له إلا الصيام فإنه لي وأنا أجزي به. والصيام جُنّة، فإذا كان يوم صوم أحدكم فلا يرفث ولا يصخب، فإن سابّه أحد أو قاتله فليقل: إني صائم. والذي نفس محمد بيده لخلوف فم الصائم أطيب عند الله من ريح المسك. وللصائم فرحتان يفرحهما: إذا أفطر فرح بفطره، وإذا لقي ربه فرح بصومه.",
        "source": "مسند أبي حنيفة",
        "narrator": "أبو حنيفة النعمان"
      }
    },
    {
      "id": "hajj",
      "title": "كتاب الحج",
      "content": {
        "id": 7,
        "hadith": "من حج هذا البيت فلم يرفث ولم يفسق رجع كيوم ولدته أمه. والحج المبرور ليس له جزاء إلا الجنة.",
        "source": "مسند أبي حنيفة",
        "narrator": "أبو حنيفة النعمان"
      }
    },
    {
      "id": "nikah",
      "title": "كتاب النكاح",
      "content": {
        "id": 8,
        "hadith": "يا معشر الشباب من استطاع منكم الباءة فليتزوج، فإنه أغض للبصر وأحصن للفرج، ومن لم يستطع فعليه بالصوم فإنه له وجاء. والمرأة تُنكح لأربع: لمالها ولحسبها ولجمالها ولدينها، فاظفر بذات الدين تربت يداك.",
        "source": "مسند أبي حنيفة",
        "narrator": "أبو حنيفة النعمان"
      }
    },
    {
      "id": "talaq",
      "title": "كتاب الطلاق",
      "content": {
        "id": 9,
        "hadith": "أبغض الحلال إلى الله الطلاق. وإن المرأة إذا سألت زوجها الطلاق من غير بأس فحرام عليها رائحة الجنة.",
        "source": "مسند أبي حنيفة",
        "narrator": "أبو حنيفة النعمان"
      }
    },
    {
      "id": "jihad",
      "title": "كتاب الجهاد",
      "content": {
        "id": 10,
        "hadith": "قام رجل إلى النبي ﷺ فقال: أي الناس أفضل؟ قال: مؤمن يجاهد بنفسه وماله في سبيل الله. قال: ثم من؟ قال: رجل معتزل في شعب من الشعاب يعبد ربه، ويدع الناس من شره.",
        "source": "مسند أبي حنيفة",
        "narrator": "أبو حنيفة النعمان"
      }
    },
    {
      "id": "akhlaq",
      "title": "كتاب الأخلاق",
      "content": {
        "id": 11,
        "hadith": "أكمل المؤمنين إيماناً أحسنهم خلقاً، وخياركم خياركم لنسائهم.",
        "source": "مسند أبي حنيفة",
        "narrator": "أبو حنيفة النعمان"
      }
    },
    {
      "id": "birr",
      "title": "كتاب بر الوالدين",
      "content": {
        "id": 12,
        "hadith": "جاء رجل إلى النبي ﷺ فقال: يا رسول الله من أحق الناس بحسن صحابتي؟ قال: أمك. قال: ثم من؟ قال: أمك. قال: ثم من؟ قال: أمك. قال: ثم من؟ قال: أبوك.",
        "source": "مسند أبي حنيفة",
        "narrator": "أبو حنيفة النعمان"
      }
    },
    {
      "id": "sidq",
      "title": "كتاب الصدق",
      "content": {
        "id": 13,
        "hadith": "عليكم بالصدق فإن الصدق يهدي إلى البر، وإن البر يهدي إلى الجنة، ولا يزال الرجل يصدق ويتحرى الصدق حتى يُكتب عند الله صديقاً. وإياكم والكذب فإن الكذب يهدي إلى الفجور، وإن الفجور يهدي إلى النار، ولا يزال الرجل يكذب ويتحرى الكذب حتى يُكتب عند الله كذاباً.",
        "source": "مسند أبي حنيفة",
        "narrator": "أبو حنيفة النعمان"
      }
    },
    {
      "id": "amanah",
      "title": "كتاب الأمانة",
      "content": {
        "id": 14,
        "hadith": "آية المنافق ثلاث: إذا حدث كذب، وإذا وعد أخلف، وإذا اؤتمن خان.",
        "source": "مسند أبي حنيفة",
        "narrator": "أبو حنيفة النعمان"
      }
    },
    {
      "id": "rahma",
      "title": "كتاب الرحمة",
      "content": {
        "id": 15,
        "hadith": "الراحمون يرحمهم الرحمن، ارحموا من في الأرض يرحمكم من في السماء.",
        "source": "مسند أبي حنيفة",
        "narrator": "أبو حنيفة النعمان"
      }
    },
    {
      "id": "adl",
      "title": "كتاب العدل",
      "content": {
        "id": 16,
        "hadith": "سبعة يظلهم الله في ظله يوم لا ظل إلا ظله: إمام عادل، وشاب نشأ في عبادة الله، ورجل قلبه معلق بالمساجد، ورجلان تحابا في الله اجتمعا عليه وتفرقا عليه، ورجل دعته امرأة ذات منصب وجمال فقال: إني أخاف الله، ورجل تصدق بصدقة فأخفاها حتى لا تعلم شماله ما تنفق يمينه، ورجل ذكر الله خالياً ففاضت عيناه.",
        "source": "مسند أبي حنيفة",
        "narrator": "أبو حنيفة النعمان"
      }
    },
    {
      "id": "akhira",
      "title": "كتاب الآخرة",
      "content": {
        "id": 17,
        "hadith": "الكَيِّسُ من دان نفسه وعمل لما بعد الموت، والعاجز من أتبع نفسه هواها وتمنى على الله الأماني.",
        "source": "مسند أبي حنيفة",
        "narrator": "أبو حنيفة النعمان"
      }
    },
    {
      "id": "quran",
      "title": "كتاب القرآن",
      "content": {
        "id": 18,
        "hadith": "اقرؤوا القرآن فإنه يأتي يوم القيامة شفيعاً لأصحابه. اقرؤوا الزهراوين: البقرة وآل عمران، فإنهما تأتيان يوم القيامة كأنهما غمامتان أو غيايتان أو كأنهما فرقان من طير صواف تحاجان عن أصحابهما.",
        "source": "مسند أبي حنيفة",
        "narrator": "أبو حنيفة النعمان"
      }
    },
    {
      "id": "sadaqa",
      "title": "كتاب الصدقة",
      "content": {
        "id": 19,
        "hadith": "اتقوا النار ولو بشق تمرة، فمن لم يجد فبكلمة طيبة.",
        "source": "مسند أبي حنيفة",
        "narrator": "أبو حنيفة النعمان"
      }
    },
    {
      "id": "marham",
      "title": "كتاب المروءة",
      "content": {
        "id": 20,
        "hadith": "ليس الشديد بالصرعة، إنما الشديد الذي يملك نفسه عند الغضب.",
        "source": "مسند أبي حنيفة",
        "narrator": "أبو حنيفة النعمان"
      }
    },
    {
      "id": "sabr",
      "title": "كتاب الصبر",
      "content": {
        "id": 21,
        "hadith": "عجباً لأمر المؤمن إن أمره كله له خير، وليس ذاك لأحد إلا للمؤمن: إن أصابته سراء شكر فكان خيراً له، وإن أصابته ضراء صبر فكان خيراً له.",
        "source": "مسند أبي حنيفة",
        "narrator": "أبو حنيفة النعمان"
      }
    },
    {
      "id": "ziyarah",
      "title": "كتاب زيارة القبور",
      "content": {
        "id": 22,
        "hadith": "كنت نهيتكم عن زيارة القبور، ألا فزوروها فإنها تذكر الآخرة.",
        "source": "مسند أبي حنيفة",
        "narrator": "أبو حنيفة النعمان"
      }
    },
    {
      "id": "adab",
      "title": "كتاب الأدب",
      "content": {
        "id": 23,
        "hadith": "إن من أحبكم إليّ وأقربكم مني مجلساً يوم القيامة أحاسنكم أخلاقاً.",
        "source": "مسند أبي حنيفة",
        "narrator": "أبو حنيفة النعمان"
      }
    },
    {
      "id": "akhira_sirat",
      "title": "كتاب الصراط",
      "content": {
        "id": 24,
        "hadith": "يوضع الصراط يوم القيامة بين ظهراني جهنم، فأكون أنا وأمتي أول من يجيزها، ولا يتكلم يومئذ إلا الرسل، ودعوى الرسل يومئذ: اللهم سلم سلم.",
        "source": "مسند أبي حنيفة",
        "narrator": "أبو حنيفة النعمان"
      }
    },
    {
      "id": "riyadh",
      "title": "كتاب الرياضة الروحية",
      "content": {
        "id": 25,
        "hadith": "المؤمن القوي خير وأحب إلى الله من المؤمن الضعيف، وفي كل خير. احرص على ما ينفعك، واستعن بالله ولا تعجز، وإن أصابك شيء فلا تقل: لو أني فعلت كان كذا وكذا، ولكن قل: قدر الله وما شاء فعل، فإن لو تفتح عمل الشيطان.",
        "source": "مسند أبي حنيفة",
        "narrator": "أبو حنيفة النعمان"
      }
    },
    {
      "id": "akhlaq_samt",
      "title": "كتاب الصمت",
      "content": {
        "id": 26,
        "hadith": "من كان يؤمن بالله واليوم الآخر فليقل خيراً أو ليصمت.",
        "source": "مسند أبي حنيفة",
        "narrator": "أبو حنيفة النعمان"
      }
    },
    {
      "id": "akhlaq_hilm",
      "title": "كتاب الحلم",
      "content": {
        "id": 27,
        "hadith": "إن الله رفيق يحب الرفق، ويعطي على الرفق ما لا يعطي على العنف وما لا يعطي على ما سواه.",
        "source": "مسند أبي حنيفة",
        "narrator": "أبو حنيفة النعمان"
      }
    },
    {
      "id": "husn_dhan",
      "title": "كتاب حسن الظن",
      "content": {
        "id": 28,
        "hadith": "إن الله يقول: أنا عند ظن عبدي بي، وأنا معه إذا ذكرني، فإن ذكرني في نفسه ذكرته في نفسي، وإن ذكرني في ملإ ذكرته في ملإ خير منهم، وإن تقرب إلي شبراً تقربت إليه ذراعاً، وإن تقرب إلي ذراعاً تقربت إليه باعاً، وإن أتاني يمشي أتيته هرولة.",
        "source": "مسند أبي حنيفة",
        "narrator": "أبو حنيفة النعمان"
      }
    },
    {
      "id": "akhlaq_iya",
      "title": "كتاب عيادة المريض",
      "content": {
        "id": 29,
        "hadith": "إن الله عز وجل يقول يوم القيامة: يا ابن آدم مرضت فلم تعدني. قال: يا رب كيف أعودك وأنت رب العالمين؟ قال: أما علمت أن عبدي فلاناً مرض فلم تعده، أما علمت أنك لو عدته لوجدتني عنده؟",
        "source": "مسند أبي حنيفة",
        "narrator": "أبو حنيفة النعمان"
      }
    },
    {
      "id": "akhlaq_ikhwan",
      "title": "كتاب حقوق الإخوان",
      "content": {
        "id": 30,
        "hadith": "حق المسلم على المسلم ست: إذا لقيته فسلم عليه، وإذا دعاك فأجبه، وإذا استنصحك فانصح له، وإذا عطس فحمد الله فشمته، وإذا مرض فعده، وإذا مات فاتبعه.",
        "source": "مسند أبي حنيفة",
        "narrator": "أبو حنيفة النعمان"
      }
    }
  ]
}
